/**
 * 翻译模块的繁体汉字判定：Unicode 17.0.0 Unihan 中含不同 kSimplifiedVariant 的字符。
 * 字形可能有歧义，命中时保留 API 翻译；本表不执行简繁转换。
 * 数据来源：https://www.unicode.org/Public/17.0.0/ucd/Unihan.zip
 * 属性定义：https://www.unicode.org/reports/tr38/#kSimplifiedVariant
 * © 2025 Unicode®, Inc.；许可见 LICENSES/Unicode-3.0.txt。
 */
export const TRANSLATE_TRADITIONAL_HAN: RegExp = new RegExp(
  "[" +
  "㑮㑯㑳㑶㒓㒖㒜㒣㒿㓄㓖㓨㔃㔅㔋㔝㔢㕒㕢㖦㖮㗙㗢㗣㗰㗲㗶㗻㗼㗿㘓㘔㘖㘙㘚㘤㙔㙡㙢㙬㙺㙾㛍㛝㜄㜏㜐㜕㜗㜞㜢㜥㜭㜮㜰㜷㜺㝞㝟㞞㟦㟺㠁㠆㠏㠠㠣㡓㡞㢗㢝㤲㥮㥷㦊㦎㦖㦛㦞㦡㦦㦬㦭㨛㨟㨥㨻㩇㩋㩌㩜㩣㩭㩳㩵㩷㩹㪎㪹" +
  "㬢㬣㬮㮓㮝㮲㮿㯂㯆㯤㯸㯼㰂㰄㰅㰍㰰㰳㲯㲰㲲㴸㴿㵍㵑㵒㵗㵤㵾㶆㶌㶍㶏㶒㶕㷃㷍㷲㷶㷻㷿㸅㸊㸐㹓㹽㺏㺑㺜㻶㻽㼀㼁㼆㼈㼻㾵㾺㿉㿎㿖㿗㿧㿹䀉䀍䀴䀹䁝䁪䁱䁻䂎䂓䃁䃕䃘䃢-䃤䃮䃴䅐䅘䅳䆅䆉䇓䉆䉍䉐䉑䉙䉬䉱䉲䉶䊜䊟䊭" +
  "䊲䊵䊷䊺䋃䋆䋍-䋑䋔䋙䋚䋦䋫䋹-䋿䌁䌇䌈䌋䌌䌐䌖䌝-䌟䌥䌪䌰䍤䍷䍽䎘䎙䎱䏊䐢䐣䐷䐹䐽䑗䑼䓣䔇䔈䔡䕏䕡䕤䕳䕹䕼䖀䖅䖚䗃䗅䗥䗻䗽䗿䙔䙡䙱䙼䚆䚉䚕䚞䚩䚳䚵䚽䛀䛄䛌䛍䛘䛛䛞䛠䛤䛬䛭䛳䛴䛽䛿䜀䜄䜉䜋䜍-䜏䜒䜖䜚" +
  "䜝䝏䝕䝭䝯䝻䝼䞀-䞂䞈䞉䞋䞓䟃䟆䟏䟐䟺䠆䠟䠠䠩䠮䠱䡁䡄䡅䡇䡊䡐䡗䡘䡝䡟䡦䡩䡰䡴-䡷䡻䡾䢈䢨䤌䤍䤠䤤䤥䤨-䤪䤬䤭䤵䤸䤻䤼䥄䥇䥑䥓䥕-䥗䥛䥝䥞䥩䥯䥱䥴䥶-䥸䦌䦎䦖䦘䦛䦝䦟䦣䦪䦯䦱䦳䧞䧢䨴䩤䩫䪊䪍䪏䪐䪓䪗䪘" +
  "䪜䪝䪥䪴䪼䪾䫀䫂䫈䫉䫌䫏䫐䫜䫟䫠䫥䫩䫴䫶䫻䫼䫾䬀䬂䬅䬍䬎䬐䬓䬔䬘䬝-䬟䬣䬧䬪-䬬䬯䬲䬳䬶䬹䬾䭀䭃䭅䭇-䭉䭑-䭕䭘䭞䭡-䭣䭭䭿䮂䮄䮈䮗䮝䮞䮠䮧䮫䮰䮲䮳䮸䮽-䯀䯤䰎䰐䰖䰫䰲䰷䰻䰽䰾䱀-䱂䱅䱇䱌-䱎䱐䱒䱓䱗" +
  "䱙-䱜䱟䱡䱤䱥䱧䱬䱭䱰䱱䱴䱵䱷-䱹䱻䱽䱾䲁䲅䲉䲏䲕-䲛䲨䲰䲸䲹䲼䳅䳇䳍䳏䳒䳓䳕䳚䳜䳟䳢䳤䳥䳧䳨䳫䳭䳮䳲䳺䳽䴇-䴉䴋䴏䴚䴝䴬-䴮䴱-䴵䴷-䴺䴽䵂䵃䵆䵐䵘䵳䵴䵶䵷䶕䶗䶢䶣䶦-䶨䶪䶱䶲丟並乾亂亞佇併來侖侶" +
  "俁係俓俔俠俥倀倆倈倉個們倫倲偉偑偩側偵偽傌傑傖傘備傢傪傭傯傱傳-債傷傾僀僂僅僆僉働僑僓僕僗僞僤僥僨僩僴價僾儀-儂億儅儈儉儐儔-儖儘償儢儣儥儩優儮儰-儲儷-儼兌兒兗內兩冊冪凈凍凔凙凜凟凱凴別刪剄則剋剎剗" +
  "剛剝剮剴創剸剾劃劇劉劊劌劍劏劑劗劚勁勑動務勛勝勞勢勣勩勱勴勵勸勻匭匯-匱匵區協卨卻厙厠厭厱厲厴參叄叢吒吳吶呂咼員哯唄唊唓唚唻問啓啞啟啢喎喚喡喪喬單喲嗆嗇嗊嗎嗚嗧嗩嗶嗹嗿嘄嘆嘇嘍嘓嘔嘖嘗嘜嘩嘪嘮-嘰嘳嘵" +
  "嘸嘺嘽噁噅噓噚噝噞噠噥噦噯噲噴噸噹嚀嚂嚇嚈嚌嚍嚐嚕嚙嚛嚝嚠嚦-嚬嚮嚱-嚴嚶嚸嚽嚿-囃囅囇-囉囋囌囐-囒囕囪圇國圍園圓圖團圞垵垷垻埉埡埨埬埰執堅堈堊堖堚堝堯報場塊塋塏塒塗塢塤塵塸塹塼塿墆墊墋墏墜墝墠墢墧" +
  "墮墳墶墷墻墾墿壇壈壋壍壏壐壒-壔壗-壛壝-壠壢壣壧壩壪壯壺壼壽夠夢夥夾奐奧奩-奬奮奯奲奼妝姍姦娙娛婁婡婦婭婸媁媈媜媧媯媰媼媽嫈嫗嫢嫥嫧嫵嫻嫿嬀嬃嬅嬇嬈嬋嬌嬐嬒嬙嬝嬟嬡嬣嬤嬦嬧嬪嬮嬰嬸嬻嬾孄孆孇孋孌孎孏" +
  "孫孲學孻孾孿宮寠寢實寧審-寬寯寵-寷將專尋對導尷屆屍屓屜屢層屨屩屬岡峴島峽崍崗崙崠崢崬崱崵嵐嵷嵸嵼-嵾嶁嶄嶇嶈嶔嶗嶠嶢嶤嶧-嶪嶮嶴嶸-嶺嶼嶽巃巆巊巋巑巒巔巖-巘巚巠巰帥師帳帴帶幀幃幓幗幘幟幠幣幩幫幬" +
  "幰幱幹幺幾庫庲廁廂廄廈廎廔廕廗廚廝-廣廥廧廩廬廮廳弒弳張強彄彆彈彌-彎彙彞彠彥彲後徑從徠復徵徹徿恆恥悅悏悓悞悵悶惀惡惱惲惻愇愛愜愨愩愴愷愾慄態慍慐慖慘-慚慟慣慤慪慫慮慯慱-慳慶慸-慺憂憅憊憍憐-憒憖憚" +
  "憢憤憦憪憫憮憲憴憶憸憹懀懇應懌懍懓懕懘懙懜懞-懠懣懤懧-懩懫懭懰懲懶-懸懺懼懾戀戁戃戇戔戠戧戩戰-戲戶拋挩挾捨捫捲掁掃掄掆掗掙-掛採揀揚換揮搊損搎搖搗搵搶摀摃摋摐摑摕摙摜摟摪摫摯摲摳摶摺-摼撈撊-撌" +
  "撏撐撓撝撟撣撥撧撫撲撳撶撻撾撿擁擃擄擇擈擊擋擓擔據擟擠擣擥擧擪-擬擯-擴擷擺-擾攄攆攋攎攏攑攔攖攙攛-攞攢-攤攦攧攩攪攬攳敗敘敳敵數敺敿斁-斆斕斬斷斸於旝旟昜時晉晛晝暈-暊暐暘暟暢暫曄曆曇曉曊曏曖曠曥" +
  "曨曬-曮書會朥朧東柵桱桿梔梖梘梜條梟梲棄棆棖棗棟棡棧棲棶椏椚椲楇楊楎楓楨業極榝榪榮榯榲榿構槍槤槧槨槫槮槳槶槻槼樁樂樅樓標樞樠樢樣樫樲樳樸-樻樿橃橅橈橋橚機橢橨橫橯檁檂檉檋檒檔檛檜檟檡-檣檥檭-檰檲檳檵" +
  "檸檻檾檿櫃櫅櫍-櫏櫓櫚櫛櫝-櫠櫢櫥-櫬櫯櫱櫳櫴櫶櫸櫹櫻櫽欄欆欇權欍欏-欓欖欘欞欽歄歍歐歕歗歛歞歟歡歲歷歸歿殘殞殢殤殨殫殮-殰殲殺-殼毀毄毆毊毚毿氀氂氈氌氣氫-氭氳決沒沖況洶浹浿涇涷涼淚淥淪淵淶淺渙減渢" +
  "渦測渾湊湋湞湯溈準溝溡溤溫溮溰溳滄滅滌滎滬滭滯滲滷滸滻滾滿漁漊漍漎漐漙漚漢漣漬漲漵漸漿潁潑潔潕潙-潛潣潤潬潯潰潷潿澀澅-澇澐澒澕-澗澠澢澤澦澩澫澬澮澰澱澾濁濃濄濆濇濊濕濘濚-濜濟濤濧濫濰濱濴濺濼濾濿" +
  "瀁-瀉瀋瀏瀕瀗-瀙瀝瀟瀠瀢瀦-瀨瀭瀯瀰瀲-瀵瀾灃灄灍灑-灓灕灘灙灝灟-灡灣灤灦灧災為烏烴焛無煇-煉煒煙煢煥煩煬煱煼熂熅熉熌熒熓熕熗熞熡熰-熲熾燀燁燆燈燌燒燖燘燙燜營燡燦燭燰燴-燶燼-燾爁爃爄爍爐爓爖爗" +
  "爛爣爥爧爭爲爺爾牆牋牘牼牽犅犓犖犞犢犤犧狀狹狽猌猍猙猧猶猻獁獄獅獊獎獑獖獟獢獨-獫獮獰-獲獵獷-獼玀-玂珼現琖琺琿瑋瑒瑙瑣瑤瑩瑪瑲瑻瑽璉璊璍璕璗璛璝璡璣璦璫璯環璵璸璹璼-璾瓄瓅瓊瓏瓐瓓-瓕瓚瓛甊甌甒甖" +
  "產産畝畢畫異當疇疊痙痮痾瘂瘋瘍瘑-瘓瘞瘡瘧瘮瘱瘲瘺瘻療癆-癉癎癐癘癟癠癢癤癥癧癩癪癬-癮癰-癲癴發皚皟皪皰皸皺皾盜盞盡監盤盧盨盪眥眾睍睏睔睜睞睪睴瞓瞘瞛瞜瞞瞡瞤瞭瞯瞱瞶瞷瞼矇矉矊矑矓矕矖矘矚矯矲硃硜硤" +
  "硨硯碙碢碩碭碸確碼碽磑磒磚磠磣磧磯磱磵磽磾礄礆礋礎-礐礒礙-礛礥礦礩-礬礮礰-礲礹祿禍禎禓禕禜禡禦禪禬禮-禱禵禿秈稅稈稏稟稦種稱穀穇穌-穎穖穠-穢穧-穩穫-穭窩窪窮窯窱窵窶窺竀竄竅竇-竊竪竱競筆筍筧筴" +
  "箂箋箏箹節範築篋篔篘篢篤篩篳篵篸篿簀簂簍簜簞簡-簣簥簫簵簹簻簽簾籃籋籌籔籙-籜籟籠籣籤籦籩-籯籲粯粵粻糝糞糧糮糰糲糴糶糷糹糺糽糾紀-紉紋-納紐-紟紡紨紩紬紭細-紳紵紶紸-紺紼-絇絍絎結絑絓絕絖絘-絛" +
  "絝-絨絪絯-絳絶絸-綁綃-綐經綕綖綘綜-綣綧綪-維綯-綵綷-緂緄-緇緉-総緑-緔緗-緛緝-緤緦-緬緮-緲練-緼縈-縎縐-縓縕-縗縚-縟縡縣縧縩-縺縼-繀繂繃繅繆繈繎-繚繜繞繟繡-繣繨-繰繲繳繵-繹" +
  "繻-纁纃纆-纈纊-纍纏纑纓-纘纚纜缽罃罆罈罌罎罏罰罵罷罼羂羅羆羈羋羥義羵習翜翬翹翽翿耬耮聖聞聯聰聲聳聵-職聹聻聽聾肅脅脈脛脥脫脹腎腖腡腦腪腫腳腸膃膋膒膕膚膞膠膢膩膮膴膶膷膹膽-膿臇臉臍臏臗臘臚臟-臢臤" +
  "臨臺與-舊艙艛艜艤艦艫艭艱艷芻苧茲荊莊莖莢莧菕華萇萊萬萯萴萵葉葒著葝葤葦葯葷葻蒍蒒-蒔蒙蒞蒭蒳蒶蒼蓀蓋蓮蓯蓲蓴蓽蔄蔎蔔蔞蔠蔣蔥蔦蔪蔭-蔯蔱蔿蕁蕄蕆蕎蕑-蕓蕕蕘蕝蕟蕡蕢蕧蕩蕪蕭蕳蕷蕽薀薆薈-薌薑薔薖薘" +
  "薟薠薦薩薱-薵薺藇藉藍藎藖藘藚藝藣藥藪藬藭藰藴藶藷藹藺藾蘀蘄蘆-蘈蘊蘋蘚蘞蘟蘡蘢蘫-蘭蘱蘵蘹蘺蘿虅虆虉處虛虜號虦虧虯蛵蛺-蛼蜆蜦蜸蜽蝀蝁蝕蝜蝟蝦蝸螄螘螞螢螮螴螹螻螿蟂蟄蟈蟎蟘蟜蟡蟣蟦蟬蟯蟱-蟳蟶蟷蟻蟽" +
  "蠀蠁蠅蠆蠈蠌蠐-蠒蠙蠞蠟蠣蠦蠨蠪蠱蠳蠶蠻蠾衆衊術衕衚衛衝衹袞裊裌裏補裝裡裲製複褌褘褭褲褳褸褺褻襀襂襇襌襏襓襖-襘襛襝襠襤襨襪襬襭襯-襲襴襵襸襹襼覆見覎規覒覓覕-覘覛覜覟-覢覤-覦覩親覬-覰覲覴覶-覽" +
  "覿觀觴觶-觹觻觽訁-訃訆計訊訌討-訓訕-記訛-訟訢訣訥-訪訬設訰許訴訶訸-註訽詀詁詃-詇詉詊詌-詘詛-詞詠-詣詥試詨-詷詺-詼詿誁-誇誋-誒誔誕誗-誚誜語誠誡誣-誨說-説誰課-誴誶誷誹-調諁-諄諆-諉" +
  "請-諏諑-諗諛-諠諢-諧諫諭-諴諶-諼諾謀-謂謄-謆謉-謑謔謖謗謙-謡謣謥謨謫-謭謯-謵謸謹謻謼謾譀譂譄-譊譌譎-譔譖識-譚譜譞-譡譨譩譫譯議譳譴護-讀讂讅-讇讉-讌讎讑-讖讘-讟豄豅豈豎豐豬豵豶貓貗" +
  "貙貝-貤貦-責貯-貴貶-貸貺-賅資賈賊賑-賓賕賗賙賚賜-賨質-賮賰賴-賶賸-賾贃-贋贍贏-贑贓-贗贙-贜赬趕趙趨趫趬趲跡踐踚踴蹌蹔蹕蹛蹡蹣-蹥蹪蹳蹺蹻躀躂躉-躋躍躎躑-躓躕躘躚躝躡躥-躧躪軀軂軃軇" +
  "軉-軏軑-軘軚-軟軤軥軧軨軫軬軮軯軱-軳軵軷-軼軾-輋輐-輦輨-輬輮輯輲-輹輻輼輾-轊轍-轛轝-轥辦辭-辯農迴逕這連進逿運過達違遙遜遞遠適遰-遲遶-選遺遼邁還邇邊邏邐郟郲郵鄆鄉鄒鄔鄖鄟鄡鄦鄧鄩鄪鄬-鄮" +
  "鄰鄲-鄴鄶鄺酇酈醆醖醜醞醟醦醧醫醬醱-醳醶釀釁釃釅釋釐釒-釕釗-釛針釟釣-釭釱-釵釷釹釺釽-鈄鈆-鈉鈋鈍-鈗鈚-鈜鈞鈠鈣-鈨鈪鈮-鈰鈲-鈺鈼-鉁鉅鉈-鉒鉔鉕鉗-鉢鉤-鉨鉬-鉮鉲鉵-銃銅銈銊銋銍銏銑銓銔" +
  "銖-銜銠銡銣銥-銬銱-銳銶-銹銻銼銾鋁-鋃鋅鋇鋉-鋍鋏-鋓鋗-鋙鋜鋝鋟-鋡鋣-鋪鋭-鋱鋶鋸鋹鋼鋾錀-錂錄錆-錈錋錍錏-錒錔錕錗-錫錭-錯録錳錶錸錺錽鍀-鍄鍆-鍋鍍鍏-鍒鍔-鍖鍘鍚-鍝鍟-鍩鍬-鍱鍴-鍶" +
  "鍺鍼鍾鎂鎄鎅鎇-鎍鎑-鎛鎝鎞鎡-鎣鎦鎧鎩鎪鎬鎮-鎰鎲鎳鎵-鎸鎿鏁-鏃鏆-鏉鏌鏍鏏-鏕鏗-鏟鏡鏢鏤-鏦鏨鏩鏰鏵鏷-鏻鏽鏾鐀鐁鐃鐄鐇-鐋鐍-鐐鐒-鐖鐘-鐚鐝鐠鐤-鐬鐮鐯鐲-鐶鐸-鐺鐼鐽鐿鑀鑄鑇-鑌鑏-鑒" +
  "鑔-鑖鑘鑙鑛鑞鑠-鑣鑥鑧鑨鑪鑭-鑲鑴鑷-鑹鑼-钃長門閂-閆閈閉開-閕閗閘閛-閟閡閣-閩閫-閭閯閱閲閵-閷閹閻-閿闃闄闆-闍闐-闖闚-關闞-闢闤闥阪陘陝陣陰陳陸陽陿隉隊階隑隕隖際隤隨險隫隮隯隱隲隴隸隻雋" +
  "雖雙雛雜雞離難雲電霢霣霧霼霽靂靄-靆靈靉靚靜靦-靨鞀鞏鞝鞦鞸鞻-鞾韁韃韆韇韉-韍韏韐韒-韔韗-韞韠-韣韻響頁-須頊頌-領頛頜頞-頢頤頦頩-頫頭-頰頲頴頵頷-頹頻頽顀顁顃-顇顉-顔顖-顙顛-類顠顢-顧" +
  "顩-顬顮-顱顳顴風颩颬-颴颶-飂飄飆-飋飍飛飝飠飢-飦飩-飫飭飯飰飲飴-飷飼-餀餂-餅餉養餌餎餏餑-餘餚-餜餞餟餡-餤餦-餭餯-餺餼餾-饁饃饅-饌饎饐-饒饗-饙饛饜饞-饢馩馪馬-馯馱-馵馹馺馼馽駁-駃" +
  "駉駊駍-駕駗-駟駡-駥駧駩-駮駰駱駴駶-騇騉-騏騑騔-騗騙-騠騢-騥騧騩-騾驀-驅驈-驐驒-驗驙-驛驞-驢驤-驦驨-驫骯髏髐髒體-髖髮鬆鬍鬖鬗鬚鬜-鬞鬠-鬢鬥鬧鬩鬮鬱鬹鬺魎魗魘魚-魝魟-魣魥-魨魪-魯" +
  "魱魴-魷魺-魾鮀-鮈鮊-鮓鮗鮘鮚-鮡鮣-鮨鮪-鮰鮳鮵-鮻鮿-鯁鯄-鯊鯌鯒鯔-鯗鯚鯛鯝鯞鯠-鯢鯤-鯬鯮鯰鯱鯴鯶-鯹鯻-鯿鰁-鰃鰅-鰍鰏-鰓鰕鰗鰛-鰝鰟-鰡鰣-鰩鰫-鰯鰱-鰷鰹-鱘鱚鱝-鱠鱢-鱨鱬-鱯鱲" +
  "鱴鱵鱷-鱻鳥-鳧鳩鳬鳭鳱-鳴鳶-鳸鳺-鴃鴅-鴇鴉鴍鴐鴒-鴕鴗-鴣鴥鴦鴨鴩鴫鴮-鴴鴶-鴻鴽-鵅鵊-鵌鵎-鵗鵙-鵝鵟-鵡鵧鵩-鵬鵮-鵹鵻-鵾鶀鶂-鶇鶉-鶌鶒-鶛鶝-鶦鶨-鶪鶬鶭鶯-鶲鶴-鶷鶹-鶽鷀-鷅" +
  "鷇-鷋鷎-鷗鷙-鷜鷞鷟鷢-鷩鷫鷭-鷰鷲鷳鷵-鷺鷽-鸇鸉-鸌鸎-鸓鸕-鸞鹵鹹鹺鹼鹽麗麡麥麧-麩麬麮-麵麷麼麽黂黃黌點黨黲黴黶-黸黽黿-鼂鼄-鼆鼈-鼊鼕鼚鼲鼴齈齊-齏齒齔-齚齜-齡齣-齧齩齪齬-齾龍-龑" +
  "龓-龖龘龜-龞龥龭龯龲龻龽鿁鿂鿐鿓鿠鿳𠁔𠁞𠌥𠎅𠎒𠏄𠏢𠏮𠏵𠐇𠐊𠐍𠐮𠐽𠑇𠑙𠑲𠖥𠖫𠗿𠘥𠜲𠝿𠞆𠞭𠟪𠠎𠠏𠠝𠠫𠩘𠩬𠬙𠵔𠵘𠵹𠶸𠶹𠷌𠷏" +
  "𠹛𠺖𠺮𠼗𠼤𠼮𠽈𠽸𠾬𠿕𠿘𠿿𡀠𡀿𡁚𡁯𡂒𡂡𡂿𡃄𡃈𡃤𡄔𡄖𡄣𡄤𡄩𡅏𡅘𡅥𡅧𡍫𡑍𡑎𡑑𡑭𡑯𡒶𡓁𡓗𡓦𡓾𡗆𡞵𡟫𡠚𡠪𡠹𡢃𡢄" +
  "𡢘𡢿𡣨𡤠-𡤢𡤫𡤶𡮉𡮣𡮤𡳳𡷨𡸗𡹬𡺠𡺨𡼱𡼾𡽗𡽳𡽵𡾆𡾱𡿖𢄋𢄓𢄼𢅡𢅣𢉿𢊃𢍰𢐗𢐟𢕩𢖕𢛔𢜭𢞁𢠰𢠼𢢀𢣏𢣐𢣚𢣭𢤌𢤜𢤧" +
  "𢤩𢤱𢤿𢥠𢯦𢯩𢯷𢱡𢲐𢲩𢲫𢲸𢲾𢳂𢳚𢴦𢴩𢵣𢵱𢶑𢶒𢶫𢷃𢷏𢷞𢷮𢸁𢸔𢸙𢸳𢸴𢸸𢹏𢹥𢹼𢹿𢺎𢺳𢿓𢿡𣀘𣀷𣀻𣂈𣄸𣈶𣊯𣋋𣋞𣋪" +
  "𣌂𣍐𣎄𣎜𣔿𣙎𣙿𣚙𣛣𣝕𣝡𣞁𣞐𣞻𣞼𣠕𣠩𣠲𣡌𣡶𣤋𣤿𣩕𣫒𣯩𣯴𣯶𣰛𣰨𣵾𣶯𣻏𣻑𣼊𣼩𣼼𣽏𣾷𣿉𣿭𤀪𤁐𤁣𤁪𤄙𤄷𤅊𤅙𤅩𤅷" +
  "𤆼𤇾𤍖𤍜𤎤𤎱𤏐𤏩𤏳𤑚𤑳𤑹𤒎𤒦𤒨𤒻𤓌𤓎𤓓𤘀𤚴𤛮𤛱𤜆𤟤𤠔𤠮𤡲𤢟𤣎𤣤𤥭𤥵𤦎𤦩𤧑𤧸𤩂𤩊𤩑𤩝𤪤𤪧𤪺𤫎𤫟𤫩𤬅𤮦𤲓" +
  "𤲢𤳷𤳸𤷃𤷽𤸫𤺉𤺔𤻜𤻝𤻲𤼈𤾉𥀬𥀲𥂫𥂸𥇔𥉸𥋝𥋟𥌃𥌚𥏝𥔂𥔬𥕥𥖅𥖏𥖩𥖲𥗇𥗴𥗹𥗺𥗽𥘃𥚗𥜐𥜰𥞵𥢊𥢢𥢶𥢷𥣻𥨐𥪂𥯤𥱸" +
  "𥳊𥴨𥴼𥵃𥵊𥵛-𥵝𥸠𥺼𥻤𥻦𥻵𥼶𥼽𥽖𥽭𥽽𥾂𥾝𥾯𥿉𥿊𥿑𥿯𦀎𦀖𦁄𦁕𦁧𦂅𦂋𦃄𦃒𦃘𦃩𦄋𦄍𦄧𦄼𦅇𦅈𦅋𦅘𦅷𦆆𦆈𦆲𦇎𦇛" +
  "𦌾𦍆𦎹𦏑𦒀𦔖𦘧𦜖𦝛𦞛𦟐𦟼𦠅𦡏𦡖𦡝𦡧𦡶𦢈𦣇𦣎𦥯𦧴𦧺𦪭𦪽𦱌𦳝𦴧𦵕𦶆𦸷𦺣𦽒𦾏𦾵𦾶𦿍𦿭𧀀𧁿𧂂𧂅𧃽𧍕𧏻𧐐𧐱𧒖𧒯" +
  "𧔥𧕟𧕦𧖦𧛸𧜁𧜂𧜗𧜘𧜣𧜵𧜶𧝞𧞅𧞔𧞣𧞫𧞶𧟌𧠈𧠥𧠳𧠵𧡍𧡪𧡴𧡸𧢃𧢄𧢍𧢢𧣴𧥣𧥺𧦝𧦦𧦧𧦭𧦵𧧝𧧭𧧵𧧸𧨊𧨝𧨳𧨾𧩎𧩕𧩙" +
  "𧩦𧩧𧩪𧩼𧪞𧪡𧪦𧪪𧪮𧫚𧫝𧬁𧬅𧬇𧬌𧬤𧬨𧬪𧬮𧬯𧬻𧭈𧭥𧭹𧮆-𧮈𧮓𧰆𧰎𧱻𧳟𧴪𧵊𧵳𧶄𧶔𧶟𧶧𧶲𧷎𧷛𧸖𧸘𧸦𧸪𧸫𧹈𧼮𧽢" +
  "𧽯𧽵𧾥𨁂𨂐𨃘𨃜𨄉𨄣𨄰𨅍𨆅𨆉𨆪𨆱𨇁𨇍𨇗𨇞𨇤𨇯𨇰𨇽𨈀𨈆𨈇𨈊𨈌𨉖𨉹𨊠𨊰𨊸𨊹𨊻𨋁𨋚𨋢𨋮𨌄𨌈𨍈𨍏𨍐𨍒𨍰𨍹𨎌𨎩𨎪" +
  "𨎮𨏒𨏔𨏠𨏥𨐶𨑊𨘀𨘌𨞨𨞪𨞺𨟊𨟑𨢿𨣃𨣈𨣉𨣞𨣧𨣨𨤋𨤡𨤻𨥈𨥕𨥛𨥜𨥟𨥤𨥦𨥭𨥮𨥺𨦍𨦡𨦫𨦱𨧀𨧐𨧚𨧜𨧫𨧰𨧱𨨏𨨛𨨝𨨢𨨯" +
  "𨨹𨩃𨩎𨩨𨩰𨪅𨪋𨪕𨪜𨪦𨫀𨫋𨫒𨫼𨬂𨬒𨬖𨬞𨬟𨭃𨭆𨭌𨭎𨭐𨭖𨭗𨭚𨭛𨭥𨭸𨮁𨮂𨮅𨮰𨮳𨯂𨯅𨯗𨯙𨯟𨯵𨰃𨰋𨰘𨰠𨰥𨰭𨰲𨰵𨰷" +
  "𨰹𨱥𨲭𨲳𨳌𨳐-𨳒𨳕𨳙𨳚𨳨𨳸𨳿𨴑𨴗𨴤𨴹𨵆𨵌𨵗𨵤𨵦𨵩𨵬𨵸𨶀𨶏𨶑𨶮-𨶰𨶲𨶻𨶿𨷈𨷲𨷻𨼳𨽈𨽏𩀨𩅙𩅦𩅾𩇉𩉍𩉙𩋬𩋰𩍜" +
  "𩎒𩎕𩎖𩎟𩎠𩎢𩏂𩏌𩏠𩏪𩏴𩏷𩐌𩐳𩑃𩑒𩑔𩑡𩑣𩑦𩒎𩒜𩒝𩒲𩒺𩒼𩓣𩓥𩓸𩓹𩔇𩔈𩔊𩔐𩔑𩔣𩔳𩕊𩕰𩖁𩖰𩖿𩗀𩗓𩗛𩗡𩗩𩗴𩗺𩘀" +
  "𩘚𩘝𩘹-𩘻𩙈𩚅𩚚𩚛𩚥𩚩𩚵𩛆𩛌𩛎𩛞𩛡𩛩𩛲𩜇𩜠𩜦𩜯𩜰𩜵𩜶𩝑𩝔𩝠𩝡𩝣𩝧𩝽𩞃𩞄𩞆𩞉𩞡𩞦𩞧𩞬𩞯𩟀𩟂𩟐𩟗𩟠𩠴𩡣𩡤" +
  "𩡺𩢀𩢍𩢖𩢡𩢰𩢲𩢴𩢸𩢼𩢾𩣊𩣋𩣏𩣑𩣔𩣡𩣫𩣵𩣺𩤊𩤙𩤲𩤵𩤸𩥃-𩥅𩥇-𩥉𩥎𩥑𩥲𩥼𩦃𩦚𩦠𩦺𩧆𩧉𩧐𩧢𩭙𩭯𩯁𩯃𩯆𩯳𩰀𩰹" +
  "𩱈𩳤𩴆𩴵𩵚𩵦𩵩𩵱𩵳𩵹𩵺𩶀𩶁𩶘𩶯-𩶱𩷒𩷓𩷕𩷰𩷶𩸃𩸄𩸆𩸡𩸣𩸤𩸦𩸩𩸬𩹂𩹊𩹎𩹝𩹽𩹾𩺝𩺞𩻗𩻛𩻧𩻬𩻮𩻰𩻱𩼔𩼶𩽅" +
  "𩽇𩽈𩽔𩽷𩾐𩾒𩾝𩿅𩿊𩿤𩿧𩿪𩿱𩿺𪀉𪀖𪀗𪀚𪀛𪀦𪀻𪀾𪁈𪁏-𪁑𪁖𪁛𪁜𪁱𪁿𪂆𪂈𪂩𪂫𪃃𪃍𪃏𪃒𪃦𪃧𪃮𪃿𪄅𪄆𪄕𪄠𪄲𪄳" +
  "𪅂𪅃𪅖𪅜𪅾𪆃𪆫𪆰𪆴𪆷𪇄𪇖𪇘𪇰𪇳𪈏𪈔𪈗𪈼𪉖𪉜𪉣𪉨𪉮𪉱𪉸𪉿𪊉𪋼𪋽𪋿𪌐𪌒𪌗𪌘𪌜𪌣𪌨𪌬-𪌰𪌽-𪍀𪍇𪍍𪍑-𪍓𪍘𪍚" +
  "𪍞𪍠𪍣𪍤𪍬𪍴𪍶𪍷𪍿𪎂𪑚𪑳𪒬𪒿𪓛𪓬𪓰𪓹𪓽𪔵𪕣𪖨𪗋𪗜𪗝𪗪𪗭𪗳𪗻𪗽𪘀𪘅𪘓𪘞𪘥𪘧-𪘩𪘬𪘯𪘲𪙉𪙍𪙏𪙑𪙕𪙞𪙤𪚅𪚔" +
  "𪚣𪚭𪚮𪚰𪛕𪝖𪝵𪟖𪢍𪢥𪦯𪮰𪯂𪳷𪴥𪵢𪷈𪼑𪾳𫃐𫃑𫃞𫃥𫃷𫃻𫄇𫇠𫈹𫉍𫋐𫋧𫌙𫍘𫒊𫒋𫒞𫒟𫒡𫒢𫒷𫓔𫔘𫔡𫖞𫗑𫗕𫗻𫘋𫜦𫣴" +
  "𫥝𫦔𫦙𫦸𫧝𫨑𫪛𫬆𫬱𫯓𫲉𫲴𫶦𫺤𫻑𫾡𬄝𬅁𬆉𬉤𬉧𬊿𬌦𬍁𬎟𬏲𬑡𬒒𬓡𬕜𬗈𬗏𬗺𬙔𬛕𬞼𬠐𬣍𬣘𬥲𬧙𬫉𬫍𬮇𬮍𬯘𬱂𬱈𬲚𬲛" +
  "𬵂𬵃𬵨𬵮𬶼𬷈𬹂𭂖𭉾𭑙𭗡𭜼𭢒𭧒𭧖𭨡𭱘𭶙𭹰𮜗𮟽𮡈𮢅𮢆𮤏𮤒𮦗𮨭𮨻𮱚𮱣𮱱𮸾𰂠𰂴𰃴𰈝𰉀𰋆𰎼𰔠𰔫𰔺𰖻𰘯𰚂𰚣𰝜𰝢𰟫" +
  "𰡓𰫆𰫏𰫛𰫳𰯲𰴏𰴦𰴽𰹈𰻞𰿢𱃡𱃢𱃪𱆥𱇋𱋂𱵭𲥂𲪙𲪼𲰍𳅰𳈆" +
  "]",
  "u"
);
